dat10 = read.table("2_data10.csv", header = TRUE, sep = ";", dec = ",")
# смотрим размерность таблицы 
dim(dat10)
# Узнаем имена переменных 
names(dat10)

str(dat10)
dat10$kali
dat10$pw

length(dat10$kali)
mode(dat10$pw)
length(dat10$pw)
mode(dat10$kali)

#length(x) - функция измерения длины вектора 
x <- c(2, 4, 5, 3, -4, 0) 
length(x) 
mode(x)

length(dat10$kali) #25
length(dat10$pw)   #25

#Найти минимум и максимум по каждой колонке
m1 = min(dat10$kali); m1
m2 = min(dat10$pw); m2
maks1 = max(dat10$kali); maks1
maks2 = max(dat10$pw); maks2

#Дисперсия
var1 = var(dat10$kali); var1 #45.97333
var2 = var(dat10$pw); var2   #2.480233


#######################################
#Среднее арифметическое
mH1 = mean(dat10$kali); mH1 # 17.84
#Среднее арифметическое вручную для Калия
mH1 = (18+17+10+13+30+16+22+22+12+25+1+25+15+19+29+20+18+9+20+26+19+13+22+9+16)/25; mH1
#Среднее арифметическое с использованием цикла по коллекции
sum = 0
for(x in dat10$kali) {
  sum = sum + x
}
mH1 = sum/length(dat10$kali); mH1
########################################


########################################
#Среднее арифметическое
mH2 = mean(dat10$pw); mH2 # 6.024
mH2 = (5.4 + 7.3 + 6.3 + 6.9 + 6.0 + 5.6 + 3.0 + 5.4 + 8.7 + 5.5 + 7.5 + 3.5 + 6.7 + 2.8 + 5.4 + 6.3 + 6.2 + 5.5 + 7.9 + 5.1 + 5.7 + 7.9 + 4.2 + 7.2 + 8.6)/25; mH2
#Среднее арифметическое для мощности с помощью цикла
sum = 0
for (x in dat10$pw){
  sum = sum + x
}
mH2 = sum/length(dat10$pw); mH2
########################################

#Стандартное отклонение
sH1 = sd(dat10$kali); sH1 # 6.780364
sH2 = sd(dat10$pw);sH2    # 1.574876

#Считаем стандартное отклонение как корень из дисперсии
so_kali = sqrt(var(dat10$kali)); so_kali # 6.780364
so_pw = sqrt(var(dat10$pw)); so_pw       # 1.57

#Посчитаем коэффициент вариации 
vH1=100*sH1/mH1; vH1 # 38.00652
vH2=100*sH2/mH2; vH2 # 26.14335

# График 10 вариант	точки и линии	black
dat10
plot(dat10$kali, dat10$pw, type = "b", col = "black", xlab = "K2O, мг/100г", ylab = "Мощность А2, см")
















