# 4. Простейшие графики
# Отчет студента Соколова вариант 10
# Теория 1.4

# График №1 
# Задаем значения вектора vessels
vessels<-c(4,5,1)
# Присваиваем имена элементам вектора
names(vessels)<-c("England","France","Norway")
# Создаем столбчатую диаграмму
barplot(vessels)

#График №2
# Задаем значения переменной x
x=seq(1,20,0.1); x
# Задаем значения переменной y
y=sin(x)
# Строим график
plot(x,y)

#График №3
# Задаем значения переменной x
x_data=c(0:10); x_data
# Задаем значения переменной y
y_data=x_data+5; y_data
# Строим график (данные,тип графика, заголовок, подписи осей, цвет точек)
plot(x_data,y_data,type = "p", main = "My chart title", xlab = "X",ylab= "Y", col="blue")

#Задание 1.4.1
# Столбчатая диаграмма обилия сорняков (доля сорняков, встретившихся на угодье (задача 1.4.1)) для видов сорняков, где pi >0,065. Подпишите столбики по-русски.
 weed = c(0.005,	0.03,	0.040,	0.078,	0.077,	0.046,	0.026,	0.064,	0.010,	0.059,	0.032,	0.084,	0.067,	0.043,	0.070, 0.008,	0.035,	0.030,	0.084,	0.066,	0.019,	0.028)
 names(weed) = c("cir", "equs",	"galeo", "galin",	"stell",	"sonch", "echin", "podm", 	"matr",	"chenop",	"polconv"	, "viol", "caps", "plant",	"agrop", "setar", "polavi", "gnah",	"stach",	"conv",	"aistn",	"amar")
 names(weed) = c("Бодяк полевой", "Хвощ полевой",	"Пикульник", "Галинсога",	"Звездочка - мокрица",	"Осот полевой", "Ежовик куриное просо", "Подмаренник цепкий", 	"Ромашка непахучая",	"Марь белая",	"Горец вьюнковый"	, "Фиалка полевая", "Пастушья сумка", "Подорожник большой",	"Пырей ползучий", "Щетинник", "Горец птичий", "Сушеница топяная",	"Чистец болотный",	"Вьюнок полевой",	"Аистник цикутовый",	"Щирица запрокинутая")
 barplot(weed[weed>0.065], col="green")
 
 #Задание 1.4.2
 x = seq(70,123,0.03)
 y = sin(x)
 plot(x,y, type = "l",col="blue", main = "График построил Соколов")