# Создание векторов
# Отчет студента Соколова вариант 10
# Теория 1.2
x<-2
y= 6
assign ("z",5)
z
# Создание векторов
c(1,2,3)
#Создание последовательности
1:10
#Команда seq (начало, конец, шаг)
seq (from=1, to=8, by=2)
seq (1,10,2)
#Объединение нескольких векторов
x=c(1,2,3)
x
x=c(x,1:3); x
#Повторы
z=rep(0.5,6); z
#Типы векторов:
char<-c("8","edge","turn8k")
logic<-c(TRUE,FALSE,TRUE,FALSE)  
#Приведение типов Char->integer->Logic.
f = c(char, logic) #logic преобразовался в char
f
#В векторе хранятся данные одного типа
test3 = c(1, TRUE, "three")
test3
  
# Задание 1.2
#С помощью функции seq (начало, конец, шаг) создайте
#последовательность для своего варианта и запишите
# ее в переменную p.
p = seq(60, 200, 6)
p
#Создайте новую переменную р1, в которой последовательность р
#повторяется несколько раз
p1 = rep(p,4)
p1
#С помощью команды с составьте простую фразу по-английски из 3-4
#слов вашего варианта
FirstPhrase = c("Can", "you", "please")
SecondPhrase = c("do", "the", "dishes", "?")
FullPhrase = c(FirstPhrase, SecondPhrase)
FullPhrase