#3. Операции с векторами
# Отчет студента Соколова вариант 10
# Теория 1.3
a=(1:10) # 1  2  3  4  5  6  7  8  9 10
a
a+2      # 3  4  5  6  7  8  9 10 11 12
a/3      # 0.33 0.66 1.00 1.33 1.66 2.00 2.33 2.66 3.0 3.33
a*4      # 4  8 12 16 20 24 28 32 36 40
b= 2:11
a+b      # 3  5  7  9 11 13 15 17 19 21

# «Правило повтора векторов». При сложении,делении, вычитании, 
# умножении, сравнении векторов разной длины:
# более короткий вектор повторяется с начала.
# Если длины векторов не будут кратны, то об этом будет предупреждение.
#Правило повтора векторов (Recycling Rule)
x<-c(2,4,5,3,-4,0)
x         # 2  4  5  3 -4  0
x*5       # 10  20  25  15 -20   0
y<-c(5,3)
y         # 5 3
x*y # (2  4  5  3 -4  0)*(5 3) = 10  12  25   9 -20   0
z<-c(1,2,3,4)
#x*z # длины векторов не кратны

#Измерение длины вектора
x<-c(2,4,5,3,-4,0)
length(x) #6

# Сравнение векторов
# При попытке сравнить два вектора, они будут сравниваться поэлементно.
x=c(3:7);x
y=c(6,3,7,9,11); y

x==y # FALSE FALSE FALSE FALSE FALSE
x<y  # TRUE FALSE  TRUE  TRUE  TRUE

#Получение определенного значения из вектора
sentence=c("walk","the","cat")
sentence
sentence[3]
sentence[3] = "dog"
sentence
sentence[4] = "to"

#Создание перечня элементов в векторе
sentence[5:7]=c("the","old","park")
sentence[1:9]

# Переменной x присвоены значения
x=c(0,1,2,7,10,14,3,89)
# Просмотр заданных значений вектора x
x
# Выбор 6-го значения в векторе x
x[6]
# Выбор 3-8-го значений в векторе x
x[3:8] # 2 7 10 14 3 89
# Выбор 4-го и 7-го значений в векторе x
x[c(4,7)] # 7 3
# Выбор значений вектора x без 3-ей точки
x[-3] # 0  1  7 10 14  3 89
# Выбор значений вектора x без 2го - 5го  значений
x[-(2:5)] #0 14  3 89
# Выбор значений вектора x больше 3
x[x>3]
# Выбор значений вектора x, удовлетворяющие условию: x больше 3 и меньше 70
x[x>3 & x<70]

#Соколов вариант 10

#Задание 1.3
x= c(12, 43,7,9,19, 21, 68, 21, 9, 17)
x[5]
x[2:7]
x[c(3,6)]
x[-1]
x[-(1:3)]
x[x>12]
x[x>7&x<17]

# Задание имён элементам вектора
ranks=11:13; ranks
names(ranks)=c("Lena","Olja","Irina")
ranks["Irina"]
# Можно задавать значение через имена
ranks["Lena"]=55
ranks
ranks["Lena"]
ranks["Olja"]
ranks["Irina"]
