# R как калькулятор.
# Отчет студента Соколова вариант 10
# Теория 1.1
7+2
20+4/5-11*7^2
((((8+3)/5)-5)*8)^4
log2(12345678)-1
16/(1+208)*log(2345)

# Задание 1.1
# Стоимость поездки в Казахстан
(150+70*6)*80 + 26167.18

# Создание векторов
# Отчет студента Соколова вариант 10
# Теория 1.2
x<-2
y= 6
assign ("z",5)
z
# Создание векторов
c(1,2,3)
#Создание последовательности
1:10
#Команда seq (начало, конец, шаг)
seq (from=1, to=8, by=2)
seq (1,10,2)
#Объединение нескольких векторов
x=c(1,2,3)
x
x=c(x,1:3); x
#Повторы
z=rep(0.5,6); z
#Типы векторов:
char<-c("8","edge","turn8k")
logic<-c(TRUE,FALSE,TRUE,FALSE)  
#Приведение типов Char->integer->Logic.
f = c(char, logic) #logic преобразовался в char
f
#В векторе хранятся данные одного типа
test3 = c(1, TRUE, "three")
test3

# Задание 1.2
#С помощью функции seq (начало, конец, шаг) создайте
#последовательность для своего варианта и запишите
# ее в переменную p.
p = seq(60, 200, 6)
p
#Создайте новую переменную р1, в которой последовательность р
#повторяется несколько раз
p1 = rep(p,4)
p1
#С помощью команды с составьте простую фразу по-английски из 3-4
#слов вашего варианта
FirstPhrase = c("Can", "you", "please")
SecondPhrase = c("do", "the", "dishes", "?")
FullPhrase = c(FirstPhrase, SecondPhrase)
FullPhrase

#3. Операции с векторами
# Отчет студента Соколова вариант 10
# Теория 1.3
a=(1:10) # 1  2  3  4  5  6  7  8  9 10
a
a+2      # 3  4  5  6  7  8  9 10 11 12
a/3      # 0.33 0.66 1.00 1.33 1.66 2.00 2.33 2.66 3.0 3.33
a*4      # 4  8 12 16 20 24 28 32 36 40
b= 2:11
a+b      # 3  5  7  9 11 13 15 17 19 21

# «Правило повтора векторов». При сложении,делении, вычитании, 
# умножении, сравнении векторов разной длины:
# более короткий вектор повторяется с начала.
# Если длины векторов не будут кратны, то об этом будет предупреждение.
#Правило повтора векторов (Recycling Rule)
x<-c(2,4,5,3,-4,0)
x         # 2  4  5  3 -4  0
x*5       # 10  20  25  15 -20   0
y<-c(5,3)
y         # 5 3
x*y # (2  4  5  3 -4  0)*(5 3) = 10  12  25   9 -20   0
z<-c(1,2,3,4)
#x*z # длины векторов не кратны

#Измерение длины вектора
x<-c(2,4,5,3,-4,0)
length(x) #6

# Сравнение векторов
# При попытке сравнить два вектора, они будут сравниваться поэлементно.
x=c(3:7);x
y=c(6,3,7,9,11); y

x==y # FALSE FALSE FALSE FALSE FALSE
x<y  # TRUE FALSE  TRUE  TRUE  TRUE

#Получение определенного значения из вектора
sentence=c("walk","the","cat")
sentence
sentence[3]
sentence[3] = "dog"
sentence
sentence[4] = "to"

#Создание перечня элементов в векторе
sentence[5:7]=c("the","old","park")
sentence[1:9]

# Переменной x присвоены значения
x=c(0,1,2,7,10,14,3,89)
# Просмотр заданных значений вектора x
x
# Выбор 6-го значения в векторе x
x[6]
# Выбор 3-8-го значений в векторе x
x[3:8] # 2 7 10 14 3 89
# Выбор 4-го и 7-го значений в векторе x
x[c(4,7)] # 7 3
# Выбор значений вектора x без 3-ей точки
x[-3] # 0  1  7 10 14  3 89
# Выбор значений вектора x без 2го - 5го  значений
x[-(2:5)] #0 14  3 89
# Выбор значений вектора x больше 3
x[x>3]
# Выбор значений вектора x, удовлетворяющие условию: x больше 3 и меньше 70
x[x>3 & x<70]

#Соколов вариант 10

#Задание 1.3
x= c(12, 43,7,9,19, 21, 68, 21, 9, 17)
x[5]
x[2:7]
x[c(3,6)]
x[-1]
x[-(1:3)]
x[x>12]
x[x>7&x<17]

# Задание имён элементам вектора
ranks=11:13; ranks
names(ranks)=c("Lena","Olja","Irina")
ranks["Irina"]
# Можно задавать значение через имена
ranks["Lena"]=55
ranks
ranks["Lena"]
ranks["Olja"]
ranks["Irina"]


# 4. Простейшие графики
# Отчет студента Соколова вариант 10
# Теория 1.4

# График №1 
# Задаем значения вектора vessels
vessels<-c(4,5,1)
# Присваиваем имена элементам вектора
names(vessels)<-c("England","France","Norway")
# Создаем столбчатую диаграмму
barplot(vessels)

#График №2
# Задаем значения переменной x
x=seq(1,20,0.0025); x
# Задаем значения переменной y
y=sin(x/0.5)
# Строим график
plot(x,y, col= "Orange")

#График №3
# Задаем значения переменной x
x_data=c(0:10); x_data
# Задаем значения переменной y
y_data=x_data+5; y_data
# Строим график (данные,тип графика, заголовок, подписи осей, цвет точек)
plot(x_data,y_data,type = "p", main = "My chart title", xlab = "X",ylab= "Y", col="blue")

#Задание 1.4.1
# Столбчатая диаграмма обилия сорняков (доля сорняков, встретившихся на угодье (задача 1.4.1)) для видов сорняков, где pi >0,065. Подпишите столбики по-русски.
weed = c(0.005,	0.03,	0.040,	0.078,	0.077,	0.046,	0.026,	0.064,	0.010,	0.059,	0.032,	0.084,	0.067,	0.043,	0.070, 0.008,	0.035,	0.030,	0.084,	0.066,	0.019,	0.028)
names(weed) = c("cir", "equs",	"galeo", "galin",	"stell",	"sonch", "echin", "podm", 	"matr",	"chenop",	"polconv"	, "viol", "caps", "plant",	"agrop", "setar", "polavi", "gnah",	"stach",	"conv",	"aistn",	"amar")
names(weed) = c("Бодяк полевой", "Хвощ полевой",	"Пикульник", "Галинсога",	"Звездочка - мокрица",	"Осот полевой", "Ежовик куриное просо", "Подмаренник цепкий", 	"Ромашка непахучая",	"Марь белая",	"Горец вьюнковый"	, "Фиалка полевая", "Пастушья сумка", "Подорожник большой",	"Пырей ползучий", "Щетинник", "Горец птичий", "Сушеница топяная",	"Чистец болотный",	"Вьюнок полевой",	"Аистник цикутовый",	"Щирица запрокинутая")
barplot(weed[weed>0.065], col="green")

#Задание 1.4.2
x = seq(70,123,0.03)
y = sin(x)
plot(x,y, type = "l",col="blue", main = "График построил Соколов")

#5. Проверка и задание рабочей директории

#Задание 1.5

getwd()
setwd("C:/Users/Peter/Desktop/test")
getwd()
setwd("C:/ModInf/zan1")


#6 Фреймы (таблицы данных), создать фрейм, загрузить из файла и сохранить в файл
#Теория 1.6
x=5/0;x #Inf

# Задаем значения первой колонки
n=c(1.2,2.3,4.5);n

# Задаем значения второй колонки
s=c("aa","bb","cc");s

# Задаем значения третьей колонки
b=c(TRUE,FALSE,TRUE);b

#Сделаем четвертую колонку в df
newcolumn = c("Math", "Ecology", "Statistics")

# Создаем data frame
df=data.frame(n,s,b, newcolumn)
df

# Обращаемся к переменной n (к столбцу с названием "n")
df$n # 1.2 2.3 4.5
df$b # TRUE FALSE  TRUE

# Обращаемся к именам колок
names(df) #"n" "s" "b" 

# Обращаемся к именам строк
rownames(df) #"1" "2" "3" "newcolumn"


# Смотрим общую статистическую характеристику
summary(df)


#___________ Работа с файлами _________________#

# Считаем данные из файла csv в переменную pole
pole=read.table("pole123_sokolov.csv",header = TRUE, sep = " ",dec = ".") 
#sep это separator - разделитель между значениями, dec это decimal - разделитель в десятичной дроби (4,2 разделитель ",")
pole

# Через метод read.csv
data = read.csv ("pole123_sokolov.csv", header = TRUE, sep = " ", dec = ".")
data

#___________ Сохранение файлов _________________#
# между значениями разделитель " ff ", десятичные дроби разделены звёздочкой
write.table(pole, "razdelitelff.csv", sep=" ff ", dec = "*", quote=FALSE)

# Посмотрим ранее созданный табличный объект df
df
write.table(df, "df.csv", sep = "|_|", dec = ",", quote = FALSE)
write.table(df, "df___.csv", sep = "___", dec = ".", quote = FALSE)


#Задание 1.6
novob10 = read.csv ("pole123_sokolov.csv", header = TRUE,    sep = " ", dec = ".")
novob10

#Размерность (dim)
dim(novob10)
# Общая характеристика переменных (summary)
summary(novob10)
# Выведите названия столбцов (names)
names(novob10)

#Отдельно выведите каждую переменную ($)
x = novob10$Humus; x
y = novob10$K2O; y
z = novob10$Pole; z
s = novob10$A1; s

#_________________График Гумус-Калий________________________#
#Постройте график между содержанием гумуса и обменного калия.

#Столбчатая диаграмма
barplot(x,y, xlab = "Гумус", ylab = "Калий", col = "green")
#график
plot(x,y, xlab = "Гумус", ylab = "Калий", col = "blue")

novob10
write.csv(novob10, "novob.csv", quote = FALSE)

